In [1]:
import pandas as pd

In [13]:
# creating a data frame from a list
data_frame = pd.DataFrame([2,2,2]);
data_frame

   0
0  2
1  2
2  2

In [14]:
df = pd.DataFrame(data = [3,4,5,6,6],index=[1,2,3,4,5],columns=['a'])
df

   a
1  3
2  4
3  5
4  6
5  6

In [21]:
# data frame from list of lists
df = pd.DataFrame([[2,3,7],[3,4]])
df

   0  1    2
0  2  3  7.0
1  3  4  NaN

In [25]:
df = pd.DataFrame([2,'3',4.0,'hyu'])
df

     0
0    2
1    3
2    4
3  hyu

In [26]:
# data frames from dict of lists

In [36]:
df  = pd.DataFrame({'age': [2,3,5]})
df

   age
0    2
1    3
2    5

In [38]:
df  = pd.DataFrame({'age': [2,3,5],
                   'name':['q','r','p']},index = [2,3,4])
df

   age name
2    2    q
3    3    r
4    5    p

In [39]:
# data frames from a list of dictionaries

In [46]:
df = pd.DataFrame([{'a':[24,7]},{'b':5}])
df

         a    b
0  [24, 7]  NaN
1      NaN  5.0

In [47]:
# data frame ops

In [60]:
df = pd.DataFrame()
df['a'] = pd.Series([2,3,4,5])
df['a']
del df['a']
df['a'] = pd.Series([2,3,4,5])
df.pop('a')
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [62]:
df['b'] = [2,3,4,5]
df

   b
0  2
1  3
2  4
3  5

In [65]:
df['a'] = [6,4,3,2]
df

   b  a
0  2  6
1  3  4
2  4  3
3  5  2

In [66]:
#selection

In [73]:
print(df.iloc[3])
df.index = ['l','m','n','o']

b    5
a    2
Name: 3, dtype: int64

In [74]:
print(df.loc['l'])

b    2
a    6
Name: l, dtype: int64

In [76]:
print(df[0:])

   b  a
l  2  6
m  3  4
n  4  3
o  5  2

In [80]:
df = df.drop('l')

In [81]:
df

   b  a
m  3  4
n  4  3
o  5  2

In [88]:
df.append(pd.DataFrame([2,3],columns=['a']))

   a    b
m  4  3.0
n  3  4.0
o  2  5.0
0  2  NaN
1  3  NaN